src/Catalogs/ВариантыБюджетов/ВариантыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВариантыБюджетов</name>
  <predefined>
    <items>
      <name>БазовыйВариант</name>
      <description>Базовый вариант</description>
    </items>
  </predefined>
  <attributes>
    <name>НачалоПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДетальностьПланирования</name>
    <type>
      <types>EnumRef.ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерМесяца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДетальностиПланирования</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/InformationRegisters/ПоказателиБюджета/ПоказателиБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПоказателиБюджета</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВариантБюджета</name>
    <type>
      <types>CatalogRef.ВариантыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоПериода</name>
    <comment>Каелндарное начало периода, рассматриваемого в бюджете.</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделБюджета</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателя</name>
    <comment>(Инф.)</comment>
    <type>
      <types>EnumRef.ТипыБюджетныхПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГрафаБюджета</name>
    <type>
      <types>CatalogRef.ГрафыБюджета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>DefinedType.СтатьяБюджета</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ПериодичностьПланирования/ПериодичностьПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПериодичностьПланирования</name>
  <enumValues>
    <name>Произвольно</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ВариантыБюджетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Возвращает структуру, заполненную свойствами, важними для изменения варианта бюджета
//
//Возвращаемое значение:
//	Структура
//		* ПределПланирования - Дата - значение одноименной константы
//		* ЕстьПлановыеПоказателиБюджета - Булево
//		* МинимальнаяДатаПоказателя - Дата - наименьшая дата, на которую имеется сумма в бюджете
//
Функция СвойстваВариантаБюджета(СсылкаВариантаБюджета) Экспорт

	Результат = Новый Структура("ПределПланирования,ЕстьПлановыеПоказателиБюджета,МинимальнаяДатаПоказателя", 
			Константы.ПределПланирования.Получить(), Ложь, Дата(1,1,1));
			
	Если Не ЗначениеЗаполнено(СсылкаВариантаБюджета) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВариантБюджета", СсылкаВариантаБюджета);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ПоказателиБюджета.НачалоПериода) КАК НачалоПериода
	|ИЗ
	|	РегистрСведений.ПоказателиБюджета КАК ПоказателиБюджета
	|ГДЕ
	|	ПоказателиБюджета.ВариантБюджета = &ВариантБюджета
	|	И (ПоказателиБюджета.Сумма <> 0
	|			ИЛИ ПоказателиБюджета.Комментарий <> """")";

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.МинимальнаяДатаПоказателя = Выборка.НачалоПериода;
		Результат.ЕстьПлановыеПоказателиБюджета = ЗначениеЗаполнено(Результат.МинимальнаяДатаПоказателя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Проверяем/устанавливаем стандартные параметры отбора
	Если Не Параметры.Свойство("Отбор") Тогда
		Параметры.Вставить("Отбор", Новый Структура);
	КонецЕсли;
	
	Если Не Параметры.Отбор.Свойство("ПометкаУдаления") Тогда
		Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	КонецЕсли;
	
	// Условие отбора на исключение конкретного варианта бюджета
	Если Параметры.Отбор.Свойство("ИсключаемаяСсылка") Тогда
		
		СтандартнаяОбработка = Ложь;
		ИсключатьКрупнуюДетальность = Параметры.Отбор.Свойство("ИсключатьКрупнуюДетальность")
									И Параметры.Отбор.ИсключатьКрупнуюДетальность;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИсключаемаяСсылка", Параметры.Отбор.ИсключаемаяСсылка);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ВариантыБюджетов.Ссылка = &ИсключаемаяСсылка
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Порядок,
		|	ВариантыБюджетов.Ссылка,
		|	ВариантыБюджетов.Представление,
		|	ВЫБОР
		|		КОГДА ВариантыБюджетов.ДетальностьПланирования = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПланирования.Неделя)
		|			ТОГДА 1
		|		КОГДА ВариантыБюджетов.ДетальностьПланирования = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПланирования.Месяц)
		|			ТОГДА 2
		|		КОГДА ВариантыБюджетов.ДетальностьПланирования = ЗНАЧЕНИЕ(Перечисление.ПериодичностьПланирования.Квартал)
		|			ТОГДА 3
		|		ИНАЧЕ 4
		|	КОНЕЦ КАК ИндексДетальности
		|ИЗ
		|	Справочник.ВариантыБюджетов КАК ВариантыБюджетов
		|ГДЕ
		|	НЕ ВариантыБюджетов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок,
		|	ВариантыБюджетов.Представление";
		
		ДанныеВыбора = Новый СписокЗначений;
		Выборка = Запрос.Выполнить().Выбрать();
		МинимальныйИндексДетальности = 0;
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Ссылка = Параметры.Отбор.ИсключаемаяСсылка Тогда
				МинимальныйИндексДетальности = Выборка.ИндексДетальности;
				Продолжить;
			КонецЕсли;
			
			Если ИсключатьКрупнуюДетальность И Выборка.ИндексДетальности > МинимальныйИндексДетальности Тогда
				Продолжить;
			КонецЕсли;
			
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
			
		КонецЦикла;
		 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#КонецЕсли
